In [2]:
import pandas as pd
import numpy as np

In [3]:
period = pd.period_range(start='2022-01-13 00:00:00',end='2022-01-13 02:30:00',freq='30T')
data = {'col1':[1,2,3,4,5,6],'col2':period}
idx = ['row1','row2','row3','row4','row5','row6']
df = pd.DataFrame(data= data, index = idx)
print(df)

      col1              col2
row1     1  2022-01-13 00:00
row2     2  2022-01-13 00:30
row3     3  2022-01-13 01:00
row4     4  2022-01-13 01:30
row5     5  2022-01-13 02:00
row6     6  2022-01-13 02:30

In [4]:
print(df.rolling(window=3).sum()) # 뒤에 추가 메서드를 이용하여 연산을 지정해주어야합니다.

      col1
row1   NaN
row2   NaN
row3   6.0
row4   9.0
row5  12.0
row6  15.0

In [8]:
print(df.rolling(window=4, closed='left').sum())

      col1
row1   NaN
row2   NaN
row3   NaN
row4   NaN
row5  10.0
row6  14.0

In [12]:
print(df.rolling(window=2, closed='right').sum())

      col1
row1   NaN
row2   3.0
row3   5.0
row4   7.0
row5   9.0
row6  11.0

In [47]:
dict_test = {
    'col1': [1, 1, 2, 2, 3, 3, 3, 4],
    'col2': [1000, 1100, 2100, 2050, 3000, 3100, 3200, 4200],
    'col3': ['a', 'b', 'a', 'c', 'a', 'a', 'd', 'e']}

In [48]:
df_test = pd.DataFrame(dict_test)

In [49]:
df_test

   col1  col2 col3
0     1  1000    a
1     1  1100    b
2     2  2100    a
3     2  2050    c
4     3  3000    a
5     3  3100    a
6     3  3200    d
7     4  4200    e

In [52]:
df_test[['col2']].rolling(3).sum()

      col2
0      NaN
1      NaN
2   4200.0
3   5250.0
4   7150.0
5   8150.0
6   9300.0
7  10500.0

In [51]:
df_test[['col2']].rolling(3, center=True).sum()

      col2
0      NaN
1   4200.0
2   5250.0
3   7150.0
4   8150.0
5   9300.0
6  10500.0
7      NaN

In [55]:
df_test.rolling(3, on= 'col2', center=True).sum()

   col1  col2
0   NaN  1000
1   4.0  1100
2   5.0  2100
3   7.0  2050
4   8.0  3000
5   9.0  3100
6  10.0  3200
7   NaN  4200

In [50]:
df_test[['col2']].rolling(3, min_periods=1, center=True).sum()

      col2
0   2100.0
1   4200.0
2   5250.0
3   7150.0
4   8150.0
5   9300.0
6  10500.0
7   7400.0

In [53]:
df_test[['col2']].rolling(3, closed='left').sum()

     col2
0     NaN
1     NaN
2     NaN
3  4200.0
4  5250.0
5  7150.0
6  8150.0
7  9300.0

In [54]:
df_test[['col2']].rolling(3, closed='right').sum()

      col2
0      NaN
1      NaN
2   4200.0
3   5250.0
4   7150.0
5   8150.0
6   9300.0
7  10500.0

In [33]:
df_test = df_test.groupby(by=['col1', 'col3'])['col2'].apply(list)

In [34]:
df_test = pd.DataFrame(df_test)

In [35]:
df_test

                   col2
col1 col3
1    a           [1000]
     b           [1100]
2    a           [2100]
     c           [2050]
3    a     [3000, 3100]
     d           [3200]
4    e           [4200]

In [36]:
df_test.reset_index(drop=False, inplace=True)

In [46]:
df_test

      col1          col2
col3
a        1        [1000]
b        1        [1100]
a        2        [2100]
c        2        [2050]
a        3  [3000, 3100]
d        3        [3200]
e        4        [4200]

In [43]:
df_test.set_index(keys=['col1', 'col3'], inplace=True)

In [45]:
df_test.reset_index(['col1'], inplace=True)